tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
std::uint32_t percentOf(std::uint32_t value, std::uint32_t total) {
    if (total == 0) {
        return 0;
    }
    const std::uint64_t percent = (static_cast<std::uint64_t>(value) * 100ULL) / total;
    return percent > 100ULL ? 100UL : static_cast<std::uint32_t>(percent);
}

void sendStatBar(const char* label, const char* value, std::uint32_t percent) {
    sendFmt("<div class='stat-bar'><div class='stat-bar-head'><span>%s</span><strong>%s</strong></div>"
            "<div class='progress'><span style='width:%lu%%'></span></div></div>",
            label,
            value,
            static_cast<unsigned long>(percent));
}

struct DailyBucket {
    std::uint32_t dayIndex = 0;
    std::uint32_t volumeMl = 0;
    std::uint32_t durationSec = 0;
};

struct LogAggregates {
    DailyBucket days[kChartDays]{};
    std::uint32_t todayMl = 0;
    std::uint32_t weekMl = 0;
    std::uint32_t monthMl = 0;
    std::uint32_t totalMl = 0;
    std::uint32_t unknownMl = 0;
    std::uint32_t unknownDurationSec = 0;
    std::uint32_t unknownCount = 0;
};

void addSaturating(std::uint32_t& target, std::uint32_t value) {
    const std::uint32_t max = UINT32_MAX;
    target = max - target < value ? max : target + value;
}

LogAggregates aggregateLogs(std::uint32_t nowSeconds) {
    LogAggregates aggregates{};
    if (!g_context.logs || !g_context.logs->ready()) {
        return aggregates;
    }
    const bool hasRealNow = nowSeconds >= kMinRealDateSeconds;
    const std::uint32_t todayDay = hasRealNow ? nowSeconds / 86400UL : 0;
    const std::uint32_t firstChartDay = hasRealNow && todayDay >= kChartDays - 1 ? todayDay - (kChartDays - 1) : 0;
    for (std::size_t i = 0; i < kChartDays; ++i) {
        aggregates.days[i].dayIndex = firstChartDay + i;
    }

    WaterLogRecord records[kMaxLogPageSize]{};
    const std::size_t total = g_context.logs->count();
    for (std::size_t offset = 0; offset < total; offset += kMaxLogPageSize) {
        const std::size_t page = offset / kMaxLogPageSize;
        const std::size_t count = g_context.logs->readPage(page, kMaxLogPageSize, records, kMaxLogPageSize);
        if (count == 0) {
            break;
        }
        for (std::size_t i = 0; i < count; ++i) {
            const WaterLogRecord& record = records[i];
            if (!waterLogHasRealTime(record)) {
                ++aggregates.unknownCount;
                addSaturating(aggregates.unknownMl, record.volumeMl);
                addSaturating(aggregates.unknownDurationSec, record.durationSec);
                continue;
            }
            addSaturating(aggregates.totalMl, record.volumeMl);
            if (!hasRealNow) {
                continue;
            }
            const std::uint32_t day = record.startTime / 86400UL;
            if (day == todayDay) {
                addSaturating(aggregates.todayMl, record.volumeMl);
            }
            if (day <= todayDay && todayDay - day < 7) {
                addSaturating(aggregates.weekMl, record.volumeMl);
            }
            if (day <= todayDay && todayDay - day < 30) {
                addSaturating(aggregates.monthMl, record.volumeMl);
            }
            if (day >= firstChartDay && day <= todayDay) {
                DailyBucket& bucket = aggregates.days[day - firstChartDay];
                addSaturating(bucket.volumeMl, record.volumeMl);
                addSaturating(bucket.durationSec, record.durationSec);
            }
        }
    }
    return aggregates;
}

std::uint32_t sumRealLogVolumeSince(std::uint32_t startTime) {
    if (!g_context.logs || !g_context.logs->ready() || startTime < kMinRealDateSeconds) {
        return 0;
    }
    std::uint32_t total = 0;
    WaterLogRecord records[kMaxLogPageSize]{};
    const std::size_t count = g_context.logs->count();
    for (std::size_t offset = 0; offset < count; offset += kMaxLogPageSize) {
        const std::size_t page = offset / kMaxLogPageSize;
        const std::size_t read = g_context.logs->readPage(page, kMaxLogPageSize, records, kMaxLogPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (waterLogHasRealTime(records[i]) && records[i].startTime >= startTime && records[i].volumeMl > 0) {
                addSaturating(total, records[i].volumeMl);
            }
        }
    }
    return total;
}

void sendDailyChart(const DailyBucket (&days)[kChartDays]) {
    std::uint32_t maxVolume = 0;
    std::uint32_t maxDuration = 0;
    for (const DailyBucket& day : days) {
        if (day.volumeMl > maxVolume) {
            maxVolume = day.volumeMl;
        }
        if (day.durationSec > maxDuration) {
            maxDuration = day.durationSec;
        }
    }
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><h3>最近 14 天出水趋势</h3>"
                            "<p class='hint'>柱状图为每日出水量 L，折线为每日出水总时长。</p>"
                            "<svg viewBox='0 0 700 260' role='img' aria-label='最近14天出水趋势'>");
    constexpr std::uint32_t chartTop = 20;
    constexpr std::uint32_t chartHeight = 150;
    constexpr std::uint32_t baseY = chartTop + chartHeight;
    constexpr std::uint32_t left = 36;
    constexpr std::uint32_t step = 46;
    constexpr std::uint32_t barWidth = 22;
    Esp32BaseWeb::sendChunk("<line class='axis' x1='30' y1='170' x2='680' y2='170'></line>");
    char points[360]{};
    points[0] = '\0';
    for (std::size_t i = 0; i < kChartDays; ++i) {
        const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step;
        const std::uint32_t barHeight = maxVolume == 0 ? 0 : (days[i].volumeMl * chartHeight) / maxVolume;
        const std::uint32_t y = baseY - barHeight;
        sendFmt("<rect class='bar' x='%lu' y='%lu' width='%lu' height='%lu'></rect>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(barWidth),
                static_cast<unsigned long>(barHeight));
        char label[8]{};
        formatDayLabel(days[i].dayIndex, label, sizeof(label));
        sendFmt("<text class='x-label' x='%lu' y='202'>%s</text>",
                static_cast<unsigned long>(x + barWidth / 2),
                label);
        const std::uint32_t lineY =
            maxDuration == 0 ? baseY : baseY - ((days[i].durationSec * chartHeight) / maxDuration);
        char point[24]{};
        std::snprintf(point,
                      sizeof(point),
                      "%s%lu,%lu",
                      i == 0 ? "" : " ",
                      static_cast<unsigned long>(x + barWidth / 2),
                      static_cast<unsigned long>(lineY));
        std::strncat(points, point, sizeof(points) - std::strlen(points) - 1);
    }
    Esp32BaseWeb::sendChunk("<polyline class='duration-line' points='");
    Esp32BaseWeb::sendChunk(points);
    Esp32BaseWeb::sendChunk("'></polyline></svg></section>");
}

void sendTimeUnsyncedChartNotice() {
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><h3>最近 14 天出水趋势</h3>"
                            "<p class='hint'>时间未同步，暂不生成按真实日期统计的图表；同步后会自动显示今日往前 14 天。</p>"
                            "</section>");
}

void formatLogTime(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds >= kMinRealDateSeconds) {
        char date[16]{};
        formatDate(seconds, date, sizeof(date));
        const std::uint32_t daySecond = seconds % 86400UL;
        std::snprintf(out, len, "%s %02lu:%02lu:%02lu",
                      date,
                      static_cast<unsigned long>(daySecond / 3600UL),
                      static_cast<unsigned long>((daySecond / 60UL) % 60UL),
                      static_cast<unsigned long>(daySecond % 60UL));
        return;
    }
    std::snprintf(out, len, "开机+%lu s", static_cast<unsigned long>(seconds));
}

void formatWaterLogTime(const WaterLogRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (waterLogHasRealTime(record)) {
        formatLogTime(record.startTime, out, len);
        return;
    }
    if (waterLogHasBootRelativeTime(record)) {
        std::snprintf(out, len, "未知时间 / 本次开机+%lu s", static_cast<unsigned long>(record.startTime));
        return;
    }
    std::snprintf(out, len, "历史未知时间");
}

